{% import "rally.helpers" as rally with context %}
{% set cluster = cluster | default('') %}
{
  "version": 2,
  "description": "EQL benchmarks based on endgame index of SIEM demo cluster",
  "default": true,
  "indices": [
    {
      "name": "endgame-4.28.2-000001",
      "body": "endgame-4.28.2-000001.json"
    }
  ],
  "corpora": [
    {
      "name": "endgame-4.28.2-000001",
      "base-url": "https://rally-tracks.elastic.co/eql",
      "documents": [
        {
          "target-index": "endgame-4.28.2-000001",
          "source-file": "endgame-4.28.2-000001-documents.json.bz2",
          "document-count": 60782211,
          "compressed-bytes": 4875067116,
          "uncompressed-bytes": 117268958204
        }
      ]
    }
  ],
  "schedule": [
    {
      "operation": "delete-index",
      "tags": "setup"
    },
    {
      "operation": {
        "operation-type": "create-index",
        "settings": {{index_settings | default({}) | tojson}}
      },
      "tags": "setup"
    },
    {
      "operation": {
        "operation-type": "cluster-health",
        "index": "endgame-4.28.2-000001",
        "request-params": {
          "wait_for_status": "{{cluster_health | default('green')}}",
          "wait_for_no_relocating_shards": "true"
        },
        "retry-until-success": true
      },
      "tags": "setup"
    },
    {
      "operation": {
        "operation-type": "bulk",
        "bulk-size": {{bulk_size | default(5000)}},
        "ingest-percentage": {{ingest_percentage | default(100)}}
      },
      "clients": {{bulk_indexing_clients | default(8)}},
      "ignore-response-error-level": "{{error_level | default('non-fatal')}}",
      "tags": "setup"
    },
    {
      "name": "refresh-after-index",
      "operation": "refresh",
      "tags": "setup"
    },
    {
      "operation": {
        "operation-type": "force-merge",
        "request-timeout": 7200
      },
      "tags": "setup"
    },
    {
      "name": "refresh-after-force-merge",
      "operation": "refresh",
      "tags": "setup"
    },
    {
      "name": "wait-until-merges-finish",
      "operation": {
        "operation-type": "index-stats",
        "index": "_all",
        "condition": {
          "path": "_all.total.merges.current",
          "expected-value": 0
        },
        "retry-until-success": true,
        "include-in-reporting": false
      },
      "tags": "setup"
    },
    {
      "operation": {
        "name": "sequence_2stage_nofilter_fetch1000_size_1000",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence by source.ip, destination.ip [process where true] [process where true]",
          "fetch_size": 1000,
	      "size" : 1000
        }
      },
      "clients": 5,
      "warmup-iterations": 20,
      "iterations": 50
    },
    {
      "operation": {
        "name": "sequence_2stage_equalityFilter_maxspan1m_fetch1000_size500_slow",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence by source.ip, destination.ip with maxspan=1m [process where user.name != \"SYSTEM\"] [process where user.name == \"SYSTEM\"]",
          "fetch_size": 1000,
	      "size" : 500
        }
      },
      "clients": 2,
      "warmup-iterations": 5,
      "iterations": 20
    },
    {
      "operation": {
        "name": "sequence_2stage_nofilter_fetch1000_size1000_tail1000_head200",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence by source.ip, destination.ip [process where true] [process where true] | tail 1000 | head 200",
          "fetch_size": 1000,
	      "size" : 1000
        }
      },
      "clients": 5,
      "warmup-iterations": 25,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_4stage_nofilter_maxspan5m_fetch1000_size100_head100_tail50",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence by source.ip, destination.ip with maxspan=5m [process where true] [process where true] [process where true] [network where true] |head 100 | tail 50",
          "fetch_size": 1000,
	      "size" : 100
        }
      },
      "clients": 5,
      "warmup-iterations": 20,
      "iterations": 50
    },
    {
      "operation": {
        "name": "sequence_3stage_startsWithfilter_maxspan30m_fetch1000_size100_tail100_head50",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence by host.name with maxspan=30m [process where startsWith(process.name, \"ssh\") == true] by process.ppid [process where startsWith(process.name, \"ssh\") == false] by process.ppid [process where startsWith(process.name, \"ssh\") == true] by process.pid | tail 100 | head 50",
          "fetch_size": 1000,
	      "size" : 100
        }
      },
      "clients": 5,
      "warmup-iterations": 25,
      "iterations": 100
    },
    {# Basic conditions #}
    {
      "operation": {
        "name": "condition_allMatches",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "any where true"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "condition_noMatches",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "any where false"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "condition_startsWith",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "process where startsWith(process.name, \"ssh\")"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {# Basic Sequence Queries #}
    {
      "operation": {
        "name": "sequence_2stages_baseline",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence [any where true] [any where true]"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_2stages_headThenTail",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence [any where true] [any where true] | head 200 | tail 100"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_2stages_tailThenHead",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence [any where true] [any where true] | tail 200 | head 100"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_2stages_maxspan1m",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence with maxspan=1m [any where true] [any where true]"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_2stages_nullJoin",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence by ?source.ip [process where true] [process where true]"
        }
      },
      "tags": ["fast"],
      "target-throughput": 5,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {# 
      Sequences of varios lengths, sequence_2stages_fewThenFew_noJoinKey is the first query in the progression.
      Note: each process.pid between 910 and 920 matches roughly the same number of events (400-500).
    #}
    {
      "operation": {
        "name": "sequence_3stages",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence [process where process.pid == 910] [process where process.pid == 911] [process where process.pid == 912]"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_5stages",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence [process where process.pid == 910] [process where process.pid == 911] [process where process.pid == 912] [process where process.pid == 913] [process where process.pid == 914]"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_10stages",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence [process where process.pid == 910] [process where process.pid == 911] [process where process.pid == 912] [process where process.pid == 913] [process where process.pid == 914] [process where process.pid == 915] [process where process.pid == 916] [process where process.pid == 917] [process where process.pid == 918] [process where process.pid == 919]"
        }
      },
      "tags": ["fast"],
      "target-throughput": 5,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {# Sequence with varying selectivity, no join key #}
    {
      "operation": {
        "name": "sequence_2stages_fewThenFew_noJoinKey",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence [process where process.pid == 910] [process where process.pid == 911]"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_2stages_fewThenMany_noJoinKey",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence [process where process.pid == 910] [process where process.pid > 80000]"
        }
      },
      "tags": ["slow"],
      "target-throughput": 0.3,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_2stages_manyThenFew_noJoinKey",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence [process where process.pid > 80000] [process where process.pid == 911]"
        }
      },
      "tags": ["slow"],
      "target-throughput": 0.3,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_2stages_manyThenMany_noJoinKey",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence [process where process.pid > 80000] [process where process.pid > 80000]"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {# Sequence with varying selectivity, high cardinality join key #}
    {
      "operation": {
        "name": "sequence_2stages_fewThenFew_highCardJoinKey",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence by process.ppid [process where process.pid == 910] [process where process.pid == 911]"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_2stages_fewThenMany_highCardJoinKey",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence by process.ppid [process where process.pid == 910] [process where process.pid > 80000]"
        }
      },
      "tags": ["slow"],
      "target-throughput": 0.3,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_2stages_manyThenFew_highCardJoinKey",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence by process.ppid [process where process.pid > 80000] [process where process.pid == 911]"
        }
      },
      "tags": ["slow"],
      "target-throughput": 0.3,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    },
    {
      "operation": {
        "name": "sequence_2stages_manyThenMany_highCardJoinKey",
        "operation-type": "eql",
        "request-timeout": 3600,
        "cluster" : "{{cluster}}",
        "index": "endgame-4.28*",
        "body": {
          "query": "sequence by process.ppid [process where process.pid == 910] [process where process.pid == 911]"
        }
      },
      "tags": ["fast"],
      "target-throughput": 10,
      "clients": 2,
      "warmup-iterations": 50,
      "iterations": 100
    }
  ]
}
